{
    "projects": [
        {
            "slug": "airtype",
            "title": "Airtype",
            "url": "http://airtype.com/",
            "mainImg": "airtype.jpg",
            "images": [
                "one.jpg",
                "two.jpg"
            ],
            "tags": [
                "HTML5",
                "SCSS",
                "SVG",
                "jQuery",
                "Responsive",
                "CraftCMS",
                "Twig"
            ],
            "copy": "<p>Airtype is a design and interactive agency based in Winston-Salem, NC and Portland, OR. Airtype's website was rebuilt to have a focus on their people and work. My role as the Front-End Developer was to take the design and translate it into a cohesive and responsive website that showcased Airtype's capabilities.</p>"
        },
        {
            "slug": "exnovo",
            "title": "Ex Novo Brewing",
            "url": "http://exnovobrew.com/",
            "mainImg": "exnovo.jpg",
            "images": [
                "one.jpg",
                "two.jpg"
            ],
            "tags": [
                "HTML5",
                "SCSS",
                "SVG",
                "jQuery",
                "Responsive",
                "CraftCMS",
                "Twig"
            ],
            "copy": "Ex Novo is a non-profit brewery and restaurant based in Portland, OR. Ex Novo is a new type of brewery that donates all of their profits to their different causes. My role as the Front-End Developer was to take the rather nice design and translate it into a responsive website that matched Ex Novo's personality."
        },
        {
            "slug": "phuzzphest",
            "title": "Phuzz Phest",
            "url": "http://phuzzphest.com/",
            "mainImg": "phuzzphest.jpg",
            "images": [
                "one.jpg",
                "two.jpg"
            ],
            "tags": [
                "HTML5",
                "SCSS",
                "SVG",
                "jQuery",
                "Responsive",
                "CraftCMS",
                "Twig"
            ],
            "copy": "Phuzz Phest is a music festival that happens every year where bands from across the country come to play in various venues across Winston-Salem, NC. My role as the Front-End Developer was to take the creative and make it come to life in a way that would showcase the event while making it easy for the concert goers to find information about it and the bands."
        },
        {
            "slug": "grizzly",
            "title": "Grizzly",
            "url": "http://mygrizzly.com/",
            "mainImg": "grizzly.jpg",
            "images": [],
            "tags": [
                "HTML5",
                "SCSS",
                "AngularJS",
                "Responsive",
                "CraftCMS"
            ],
            "copy": "<p><i>**Due to US Federal law, I am unable to show images from the website. To view the site, you will have to navigate to the site and create a login.</i></p><p>Grizzly is a worldwide chewing tobacco brand. My role as the Front-End Developer was to help convert the old website into a newly designed and more extensible site. We rebuilt it from the ground up in AngularJS to help with the ongoing evolution of the brand. It was rebuilt to be as modular as possible since Grizzly does new campaigns every quarter to engage with their customers.</p>"
        },
        {
            "slug": "nas",
            "title": "Natural American Spirits",
            "url": "https://www.nascigs.com",
            "mainImg": "nas.jpg",
            "images": [],
            "tags": [
                "HTML5",
                "SCSS",
                "AngularJS",
                "SVG",
                "Responsive"
            ],
            "copy": "<p><i>**Due to US Federal law, I am unable to show images from the website. To view the site, you will have to navigate to the site and create a login.</i></p><p>Natural American Spirits is a worldwide cigarette company. My role as the Front-End Devloper was to take the new design and completely rebuild the website to modern standards. We rebuilt it in AngularJS to help deliver a better experience, thoughtful animation and fluid movement to have a cohesive experience across any screen.</p>"
        },
        {
            "slug": "hiphopfellow",
            "title": "The Hip-Hop Fellow",
            "url": "http://thehiphopfellow.com/",
            "mainImg": "hiphopfellow.jpg",
            "images": [
                "one.jpg",
                "two.jpg"
            ],
            "tags": [
                "HTML5",
                "SCSS",
                "SVG",
                "jQuery",
                "Responsive",
                "WordPress",
                "Timber"
            ],
            "copy": "The Hip-Hop Fellow is a documentary following 9th Wonder's time at Harvard Universty. 9th Wonder needed a website to help showcase the film and to provide people a place to go to find out more information about screenings. We built the website in WordPress to allow the client to update the site as they released new information."
        },
        {
            "slug": "midnightmoon",
            "title": "Junior Johnsons Midnight Moon",
            "url": "http://juniorsmidnightmoon.com",
            "mainImg": "midnightmoon.jpg",
            "images": [
                "one.jpg",
                "two.jpg"
            ],
            "tags": [
                "HTML5",
                "SCSS",
                "jQuery",
                "Responsive",
                "WordPress"
            ],
            "copy": "Junior Johnsons Midnight Moon needed a new website to better showcase their moonshine and wanted to provide a way for their customers to submit recipes they've come up with using Junior Johnson's Midnight Moon. We built an animated and information rich website to help showcase the brand and things possible with their product."
        },
        {
            "slug": "dixon",
            "title": "Dixon & Company",
            "url": "http://dixonwm.com/",
            "mainImg": "dixonco.jpg",
            "images": [
                "one.jpg",
                "two.jpg"
            ],
            "tags": [
                "HTML5",
                "SCSS",
                "jQuery",
                "Wordpress"
            ],
            "copy": "Dixon & Company needed a website that could showcase their experience and aptitude. We built them a colorful and information rich website that provide potential clients an overall view of their capabilities while providing a cohesive browsing experience."
        },
        {
            "slug": "hoots",
            "title": "Hoots Beer",
            "url": "http://hootspublic.com/",
            "mainImg": "hoots.jpg",
            "images": [
                "one.jpg",
                "two.jpg"
            ],
            "tags": [
                "HTML5",
                "SCSS",
                "Responsive",
                "jQuery"
            ],
            "copy": "Hoots Beer Company is a brewery and bar located in Winston-Salem, NC. They didn't want anything fancy for a website but wanted to provide their customers with a synopsis of their company and beliefs. We built them a simple responsive website that accuratly portrays what they're going for in their beer and company."
        },
        {
            "slug": "moore-farms",
            "title": "Moore Farms Botanical Garden",
            "url": "http://moorefarmsbg.org/",
            "mainImg": "moorefarms.jpg",
            "images": [
                "one.jpg",
                "two.jpg"
            ],
            "tags": [
                "HTML5",
                "CSS3",
                "jQuery",
                "Responsive",
                "WordPress"
            ],
            "copy": "Moore Farms needed a website to showcase their new Botanical Garden and provide information to the general public about the garden and plants. The website displays bright colors to help represent the garden and attitude of the company while providing a cohesive, responsive and informative experience to the user."
        }
    ]
}